       01 LIVROS.
           03 CODIGO_LIVRO           PIC 9(005).
           03 NOME_LIVRO             PIC X(100).
           03 NOME_AUTOR             PIC X(100).
           03 ANO_LANCAMENTO         PIC 9(004).
